import matplotlib.pyplot as plt
import pandas as pd

# Створимо DataFrame з вашими даними
data = {
    "Район": ["Галицький", "Франківський", "Личаківський", "Шевченківський", "Сихівський", "Залізничний"],
    "$/M": [1001.7783251231527094, 953.7571428571428571, 929.0394265232974910, 890.1619047619047619, 883.5759036144578313, 859.9565217391304348],
    "Avg. Pr.": [139254, 132496, 123128, 102202, 105808, 89834],
    "Вигідність": [0.00109332537486169197, 0.00117391576613239486, 0.00118311900540123102, 0.00125300178757806590, 0.00123662273575653622, 0.00128438594722115808]
}

df = pd.DataFrame(data)

# Побудова графіків
fig, ax = plt.subplots(3, 1, figsize=(10, 15))

# Графік для $/M
ax[0].bar(df["Район"], df["$/M"], color='skyblue')
ax[0].set_title('Ціна за метр квадратний ($/M)', fontsize=10)
ax[0].set_xlabel('Район', fontsize=10)
ax[0].set_ylabel('$ /M', fontsize=10)

# Графік для Avg. Pr.
ax[1].bar(df["Район"], df["Avg. Pr."], color='lightcoral')
ax[1].set_title('Середня ціна (Avg. Pr.)', fontsize=10)
ax[1].set_xlabel('Район', fontsize=10)
ax[1].set_ylabel('Середня ціна', fontsize=10)

# Графік для Вигідності
ax[2].bar(df["Район"], df["Вигідність"], color='lightgreen')
ax[2].set_title('Вигідність ($/M / Avg. Pr.)', fontsize=10)
ax[2].set_xlabel('Район', fontsize=10)
ax[2].set_ylabel('Вигідність', fontsize=10)

# Автоматичне налаштування відстаней для графіків
plt.tight_layout()

# Показати графіки
plt.show()
